howto/howto-install-clojure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>How to install the clojure development environment</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="How to install the clojure development environment"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-24 13:07:24 CEST"/>
<meta name="author" content="Antoine R. Dumont"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">How to install the clojure development environment</h1>

<p>In this article, we will see how to rapidly install the clojure tools in a debian-like distribution (ubuntu 11.10 for example).
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Pre-requisites</a>
<ul>
<li><a href="#sec-1-1">1.1 emacs</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Installation</a>
<ul>
<li><a href="#sec-2-1">2.1 clojure</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 install</a></li>
<li><a href="#sec-2-1-2">2.1.2 check</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 leiningen 1</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 install</a></li>
<li><a href="#sec-2-2-2">2.2.2 check</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3 lein-midje</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 install</a></li>
<li><a href="#sec-2-3-2">2.3.2 check</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4 jdk installed (either sun or openjdk)</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1 instal</a></li>
<li><a href="#sec-2-4-2">2.4.2 check</a></li>
</ul>
</li>
<li><a href="#sec-2-5">2.5 git (optional)</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1 install</a></li>
<li><a href="#sec-2-5-2">2.5.2 check</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 Conclusion</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Pre-requisites</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <a href="http://www.gnu.org/software/emacs/">emacs</a></h3>
<div class="outline-text-3" id="text-1-1">

<p>See this <a href="http://adumont.fr/blog/how-to-install-emacs-24/">previous post for installing it</a>
</p></div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Installation</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <a href="http://clojure.org/">clojure</a></h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> install</h4>
<div class="outline-text-4" id="text-2-1-1">




<pre class="example">sudo aptitude install clojure
</pre>


<p>
<b>Note</b> 
<code>apt-get</code> if you do not have <code>aptitude</code> installed.
</p>
</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> check</h4>
<div class="outline-text-4" id="text-2-1-2">

<p>Type clojure in a shell
</p>


<pre class="example">clojure
user=&gt; 
</pre>


<p>
You will have a <a href="http://en.wikipedia.org/wiki/Read–eval–print_loop">repl</a> in which you could ask some function to eval.
</p>


<pre class="example">user=&gt; (+ 1 1)
2
</pre>

</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <a href="https://github.com/technomancy/leiningen">leiningen</a> 1</h3>
<div class="outline-text-3" id="text-2-2">


</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> install</h4>
<div class="outline-text-4" id="text-2-2-1">

<ul>
<li id="sec-2-2-1-1">The easy way<br/>



<pre class="example">sudo aptitude install leiningen
</pre>

<p>
If you do not have leiningen in the packages, then you must pass by the <b>not so hard</b> way.
</p></li>
</ul>
<ul>
<li id="sec-2-2-1-2">The not so hard way<br/>
<ul>
<li id="sec-2-2-1-2-1">Download the script<br/>



<pre class="example">wget https://raw.github.com/technomancy/leiningen/stable/bin/lein
</pre>

</li>
</ul>
<ul>
<li id="sec-2-2-1-2-2">Place it on your $PATH<br/>
I also like to use ~/bin.



<pre class="example">export PATH=~/bin/:$PATH
</pre>


<p>
I usually add this in the <code>~/.bashrc</code> file.
</p></li>
</ul>
<ul>
<li id="sec-2-2-1-2-3">Make it executable<br/>



<pre class="example">chmod 755 ~/bin/lein
</pre>

</li>
</ul>
<ul>
<li id="sec-2-2-1-2-4">Ask the version<br/>
This will download all it needs.



<pre class="example">lein version
</pre>

<p>
and finally gives you an output similar to this:
</p>


<pre class="example">tony@dagobah(0.11,) 09:56:26 ~/org (master) $ lein version
Leiningen 1.7.1 on Java 1.6.0_26 Java HotSpot(TM) Client VM
</pre>

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> check</h4>
<div class="outline-text-4" id="text-2-2-2">




<pre class="example">tony@dagobah(0.16,) 13:00:07 ~ $ lein repl
REPL started; server listening on localhost port 14778
user=&gt; 
</pre>


<p>
For example:
</p>


<pre class="example">user=&gt; (+ 1 1)
2
</pre>

</div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <a href="https://github.com/marick/Midje/wiki/Lein-midje">lein-midje</a></h3>
<div class="outline-text-3" id="text-2-3">


</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> install</h4>
<div class="outline-text-4" id="text-2-3-1">

<p>This is a leiningen plugin to launch unit tests for the unit test framework midje.
</p>


<pre class="example">lein plugin install lein-midje 1.0.9
</pre>


<p>
<b>Note</b>
The version [lein-midje "2.0.0-SNAPSHOT"] is leiningen 2 compatible so do not use this one.
</p></div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> check</h4>
<div class="outline-text-4" id="text-2-3-2">




<pre class="example">tony@dagobah(0.09,) 13:05:45 ~ $ lein midje --version
Couldn't find project.clj, which is needed for midje
</pre>

<p>
OK
</p></div>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> jdk installed (either sun or openjdk)</h3>
<div class="outline-text-3" id="text-2-4">


</div>

<div id="outline-container-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> instal</h4>
<div class="outline-text-4" id="text-2-4-1">

<ul>
<li id="sec-2-4-1-1">openjdk<br/>



<pre class="example">sudo aptitude install openjdk
</pre>

</li>
</ul>
<ul>
<li id="sec-2-4-1-2">sun jdk on ubuntu 11.04<br/>
<a href="https://github.com/ardumont/sh/blob/master/deploy-java-sun-11.04.sh">https://github.com/ardumont/sh/blob/master/deploy-java-sun-11.04.sh</a>
</li>
</ul>
<ul>
<li id="sec-2-4-1-3">sun jdk on ubuntu 11.10<br/>
<a href="https://github.com/ardumont/sh/blob/master/deploy-java-sun-11.10.sh">https://github.com/ardumont/sh/blob/master/deploy-java-sun-11.10.sh</a>
</li>
</ul>
</div>

</div>

<div id="outline-container-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> check</h4>
<div class="outline-text-4" id="text-2-4-2">




<pre class="example">tony@dagobah(0.32,) 13:04:16 ~ $ java -version
java version "1.6.0_26"
Java(TM) SE Runtime Environment (build 1.6.0_26-b03)
Java HotSpot(TM) Server VM (build 20.1-b02, mixed mode)

</pre>

</div>
</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> git (optional)</h3>
<div class="outline-text-3" id="text-2-5">


</div>

<div id="outline-container-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> install</h4>
<div class="outline-text-4" id="text-2-5-1">




<pre class="example">sudo aptitude install git
</pre>

</div>

</div>

<div id="outline-container-2-5-2" class="outline-4">
<h4 id="sec-2-5-2"><span class="section-number-4">2.5.2</span> check</h4>
<div class="outline-text-4" id="text-2-5-2">




<pre class="example">tony@dagobah(0.10,) 13:05:41 (129) ~ $ git version
git version 1.7.5.4
</pre>

</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Conclusion</h2>
<div class="outline-text-2" id="text-3">

<p>We have focused on the needed steps to install the clojure environment.
You will now have the power to develop with clojure.
</p>
<p>
In a near future, i intend to make some other blog posts to focus on:
</p><ul>
<li>how to install a new clojure project using leiningen
</li>
<li>how to solve a simple problem in clojure and show how these tools work together
</li>
<li>continued integration with <a href="http://about.travis-ci.org/docs/user/getting-started/">travis-ci</a>
</li>
<li><a href="http://www.heroku.com/">heroku</a> for the deploying part
</li>
<li><a href="https://github.com/fogus/marginalia">marginalia</a> for the documentation generation and the <a href="#github">github</a> integration.
</li>
</ul>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-24 13:07:24 CEST</p>
<p class="author">Author: Antoine R. Dumont</p>
<p class="creator">Org version 7.8.08 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
